print("Добре дошли в играта 'Познай лицето и периметъра на правоъгълник'!")


length = float(input("Въведете дължина на правоъгълника: "))
width = float(input("Въведете ширина на правоъгълника: "))

area = length * width

# Предположение на потребителя за лицето на правоъгълника
user_guess_area = float(input("Познайте лицето на правоъгълника: "))

# Проверка на правилността на предположението и отпечатване на резултатите
if user_guess_area == area:
    print("Браво! Вие познахте лицето на правоъгълника!")
else:
    print(f"Грешка. Правилното лице на правоъгълника е {area}.")


